-- Завдання №2 - наповнити БД --

INSERT INTO worker (name, birthday, level, salary) VALUES
('John', '1990-05-15', 'Junior', 600),
('Alice', '1985-12-02', 'Senior', 6000),
('Michael', '1992-09-20', 'Trainee', 400),
('Emily', '1988-07-10', 'Junior', 550),
('Robert', '1993-03-25', 'Middle', 2800),
('Jennifer', '1991-11-08', 'Senior', 5500),
('William', '1987-09-14', 'Middle', 2200),
('Sophia', '1994-02-18', 'Middle', 3200),
('James', '1990-06-30', 'Senior', 6000),
('Emma', '1989-04-12', 'Trainee', 350);


INSERT INTO client (name) VALUES
('Acme Corporation'),
('XYZ Corp'),
('ABC Corporation'),
('Smith Enterprises'),
('Global Industries');

INSERT INTO project (client_id, start_date,finish_date) VALUES
(1, '2022-01-01', '2022-06-30'),
(2, '2022-03-15', '2022-05-31'),
(3, '2022-02-01', '2022-04-30'),
(4, '2022-04-01', '2022-10-31'),
(5, '2022-06-01', '2023-01-31'),
(5, '2022-07-01', '2022-12-31'),
(2, '2022-09-01', '2022-11-30'),
(3, '2022-08-01', '2023-02-28'),
(5, '2022-11-01', '2023-05-31'),
(2, '2023-01-01', '2023-06-30');

INSERT INTO project_worker VALUES
(1, 1), (1, 2), (1, 3),
(2, 4), (2, 5), (2, 6),
(3, 7), (3, 8), (3, 9),
(4, 10), (5, 1), (5, 4),
(6, 7), (6, 10), (6, 9),
(6, 2), (7, 1), (7, 2),
(8, 8), (8, 9), (8, 10),
(9, 1), (10, 10), (10, 1),
(10, 6), (10, 4), (10, 5);